<template>
    <div class="index-layout">
        This is role.
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
        <br/>菜单面板宽度（作为右侧面板的左定位）
    </div>
</template>
<script>
export default {
    data() {
        return {
            
        }
    },
    computed: {
    },
    methods: {

    },
    mounted: function() {
       
    }
}

</script>
